# ConnectDuctPlaceholdersAtTee Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MechanicalUtils..::..ConnectDuctPlaceholdersAtTee Method
MechanicalUtils Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ConnectDuctPlaceholdersAtTee(Document, ElementId, ElementId) | Connects a pair of placeholders that can intersect in a Tee connection. |
| ConnectDuctPlaceholdersAtTee(Document, Connector, Connector, Connector) | Connects a trio of placeholders that can intersect in a Tee connection. |

# See Also
MechanicalUtils Class
MechanicalUtils Members
Autodesk.Revit.DB.Mechanical Namespace